app/views/movies/show.html.erb

SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
      <nav>
      <%= link_to pluralize(@movie.reviews.size, "Reviews for #{@movie.title}"), movie_reviews_path(@movie) %>