app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @review = @movie.reviews.new(review_params)
      if @review.save

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_movie
    @movie = Movie.find(params[:movie_id])